from flask_restful import Resource

class getData2(Resource):
    def get(self):
        data =  [
                    
            {"번호":1, "건물면적": 52.89,   "용도지역": "제3종일반주거",  "위도": 37.58446,      "경도": 126.99869,        "주소": " 명륜2가","주소지역": "종로구"},
            {"번호":2, "건물면적": 267.31,  "용도지역": "준주거",       "위도": 37.57595,      "경도": 127.01313,        "주소": " 창신동","주소지역": "종로구"},
            {"번호":3, "건물면적": 40.45,   "용도지역": "일반상업",       "위도": 37.57595,     "경도": 127.01313,        "주소": " 창신동","주소지역": "종로구"},
            {"번호":4, "건물면적": 452.3,   "용도지역": "제2종일반주거",   "위도": 37.57595,     "경도": 127.01313,         "주소": " 창신동","주소지역": "종로구"},
            {"번호":5, "건물면적": 201.65,  "용도지역": "일반상업",      "위도": 37.57595,      "경도": 127.01313,         "주소": " 창신동","주소지역": "종로구"},
            {"번호":6, "건물면적": 67.8,    "용도지역": "일반상업",        "위도": 37.57595,    "경도": 127.01313,         "주소": " 창신동","주소지역": "종로구"},
            {"번호":7, "건물면적": 29.22,   "용도지역": "제2종일반주거",  "위도": 37.609029,     "경도": 126.9573925,       "주소": " 구기동","주소지역": "종로구"},
            {"번호":8, "건물면적": 38.93,   "용도지역": "제3종일반주거", "위도": 37.5768977,     "경도": 126.958787012829,  "주소": "무악동","주소지역":"종로구"}
        ]
        return data